package com.xsolla.android.sdkexampleapp;

import android.app.Application;
import android.test.ApplicationTestCase;

/**
 * <a href="http://d.android.com/tools/testing/testing_android.html">Testing Fundamentals</a>
 */
public class ApplicationTest extends ApplicationTestCase<Application> {
    public ApplicationTest() {
        super(Application.class);
    }


//TODO протестировать интерфейс нашей формы на различных девайсах(разрешение, диагональ, плотность пикселей, версия Андройд)
//TODO протестировать экран формы с токеном
//TODO протестировать экран формы с токеном-владелец карты
//TODO протестировать экран формы с токеном-зип
//TODO протестировать экран формы с токеном > бразильская карта
//TODO протестировать экран формы поворот экрана
//TODO протестировать экран формы поворот экрана
//TODO протестировать экран формы загрузка формы приложение выгружено из памяти
//TODO протестировать экран формы загрузка статуса приложение выгружено из памяти
//TODO протестировать экран формы приложение выгружено из памяти
//TODO протестировать экран статуса приложение выгружено из памяти
//TODO протестировать экран формы валидация карты
//TODO протестировать экран формы валидация Cvv
//TODO протестировать экран формы валидация год
//TODO протестировать экран формы валидация месяц

//TODO протестировать апи упрощённой оплаты - кореектные данные/некорректные данные
}